// Создайте пустой объект. Добавьте свойство name со своим именем, добавьте свойство 
// surname с вашей фамилией, поменяте свойство name на Другое имя, удалите свойство surname.



// Напишите функцию которая будет принимать 1 параметр (объект) 
// и возвращать (число) кол-во свойст и методов у переданного объекта



// Напишите функцию которая посчитает общую сумму товаров, если объект будет пустой 
// то вернуть доолжно 0, если объект небыл передан должно оповестить в консоль либо 
// модалкой что что то не так и вернуть undefined.



// Напишите функцию которая вернёт самый дорогой товар, его Имя и цену.